zephyrproject-rtos/hal_microchip/include/dt-bindings/sam/sam_d5x_e5x/samd51/atsamd51p20a-pinctrl.h
/* pc13c_sercom7_pad1 */
#define PC13C_SERCOM7_PAD1 MCHP_PINMUX(c, 13, c, periph)

/* pc13d_sercom6_pad0 */
#define PC13D_SERCOM6_PAD0 MCHP_PINMUX(c, 13, d, periph)

/* pc13f_tcc0_wo3 */
#define PC13F_TCC0_WO3 MCHP_PINMUX(c, 13, f, periph)

/* pc13g_tcc1_wo7 */
#define PC13G_TCC1_WO7 MCHP_PINMUX(c, 13, g, periph)

/* pc13k_pcc_data11 */
#define PC13K_PCC_DATA11 MCHP_PINMUX(c, 13, k, periph)

/* pc14_gpio */
#define PC14_GPIO MCHP_PINMUX(c, 14, gpio, gpio)

/* pc14a_eic_extint14 */
#define PC14A_EIC_EXTINT14 MCHP_PINMUX(c, 14, a, periph)

/* pc14c_sercom7_pad2 */
#define PC14C_SERCOM7_PAD2 MCHP_PINMUX(c, 14, c, periph)

/* pc14d_sercom6_pad2 */
#define PC14D_SERCOM6_PAD2 MCHP_PINMUX(c, 14, d, periph)

/* pc14f_tcc0_wo4 */
#define PC14F_TCC0_WO4 MCHP_PINMUX(c, 14, f, periph)

/* pc14g_tcc1_wo0 */
#define PC14G_TCC1_WO0 MCHP_PINMUX(c, 14, g, periph)

/* pc14k_pcc_data12 */
#define PC14K_PCC_DATA12 MCHP_PINMUX(c, 14, k, periph)

/* pc15_gpio */
#define PC15_GPIO MCHP_PINMUX(c, 15, gpio, gpio)

/* pc15a_eic_extint15 */
#define PC15A_EIC_EXTINT15 MCHP_PINMUX(c, 15, a, periph)

/* pc15c_sercom7_pad3 */
#define PC15C_SERCOM7_PAD3 MCHP_PINMUX(c, 15, c, periph)

/* pc15d_sercom6_pad3 */
#define PC15D_SERCOM6_PAD3 MCHP_PINMUX(c, 15, d, periph)

/* pc15f_tcc0_wo5 */
#define PC15F_TCC0_WO5 MCHP_PINMUX(c, 15, f, periph)

/* pc15g_tcc1_wo1 */
#define PC15G_TCC1_WO1 MCHP_PINMUX(c, 15, g, periph)

/* pc15k_pcc_data13 */
#define PC15K_PCC_DATA13 MCHP_PINMUX(c, 15, k, periph)

/* pc16_gpio */
#define PC16_GPIO MCHP_PINMUX(c, 16, gpio, gpio)

/* pc16a_eic_extint0 */
#define PC16A_EIC_EXTINT0 MCHP_PINMUX(c, 16, a, periph)

/* pc16c_sercom6_pad0 */
#define PC16C_SERCOM6_PAD0 MCHP_PINMUX(c, 16, c, periph)

/* pc16d_sercom0_pad1 */
#define PC16D_SERCOM0_PAD1 MCHP_PINMUX(c, 16, d, periph)

/* pc16f_tcc0_wo0 */
#define PC16F_TCC0_WO0 MCHP_PINMUX(c, 16, f, periph)

/* pc16g_pdec_qdi0 */
#define PC16G_PDEC_QDI0 MCHP_PINMUX(c, 16, g, periph)

/* pc17_gpio */
#define PC17_GPIO MCHP_PINMUX(c, 17, gpio, gpio)

/* pc17a_eic_extint1 */
#define PC17A_EIC_EXTINT1 MCHP_PINMUX(c, 17, a, periph)

/* pc17c_sercom6_pad1 */
#define PC17C_SERCOM6_PAD1 MCHP_PINMUX(c, 17, c, periph)

/* pc17d_sercom0_pad0 */
#define PC17D_SERCOM0_PAD0 MCHP_PINMUX(c, 17, d, periph)

/* pc17f_tcc0_wo1 */
#define PC17F_TCC0_WO1 MCHP_PINMUX(c, 17, f, periph)

/* pc17g_pdec_qdi1 */
#define PC17G_PDEC_QDI1 MCHP_PINMUX(c, 17, g, periph)

/* pc18_gpio */
#define PC18_GPIO MCHP_PINMUX(c, 18, gpio, gpio)

/* pc18a_eic_extint2 */
#define PC18A_EIC_EXTINT2 MCHP_PINMUX(c, 18, a, periph)

/* pc18c_sercom6_pad2 */
#define PC18C_SERCOM6_PAD2 MCHP_PINMUX(c, 18, c, periph)

/* pc18d_sercom0_pad2 */
#define PC18D_SERCOM0_PAD2 MCHP_PINMUX(c, 18, d, periph)

/* pc18f_tcc0_wo2 */
#define PC18F_TCC0_WO2 MCHP_PINMUX(c, 18, f, periph)

/* pc18g_pdec_qdi2 */
#define PC18G_PDEC_QDI2 MCHP_PINMUX(c, 18, g, periph)

/* pc19_gpio */
#define PC19_GPIO MCHP_PINMUX(c, 19, gpio, gpio)

/* pc19a_eic_extint3 */
#define PC19A_EIC_EXTINT3 MCHP_PINMUX(c, 19, a, periph)

/* pc19c_sercom6_pad3 */
#define PC19C_SERCOM6_PAD3 MCHP_PINMUX(c, 19, c, periph)

/* pc19d_sercom0_pad3 */
#define PC19D_SERCOM0_PAD3 MCHP_PINMUX(c, 19, d, periph)

/* pc19f_tcc0_wo3 */
#define PC19F_TCC0_WO3 MCHP_PINMUX(c, 19, f, periph)

/* pc20_gpio */
#define PC20_GPIO MCHP_PINMUX(c, 20, gpio, gpio)

/* pc20a_eic_extint4 */
#define PC20A_EIC_EXTINT4 MCHP_PINMUX(c, 20, a, periph)

/* pc20f_tcc0_wo4 */
#define PC20F_TCC0_WO4 MCHP_PINMUX(c, 20, f, periph)

/* pc20i_sdhc1_sdcd */
#define PC20I_SDHC1_SDCD MCHP_PINMUX(c, 20, i, periph)

/* pc20n_ccl_in9 */
#define PC20N_CCL_IN9 MCHP_PINMUX(c, 20, n, periph)

/* pc21_gpio */
#define PC21_GPIO MCHP_PINMUX(c, 21, gpio, gpio)

/* pc21a_eic_extint5 */
#define PC21A_EIC_EXTINT5 MCHP_PINMUX(c, 21, a, periph)

/* pc21f_tcc0_wo5 */
#define PC21F_TCC0_WO5 MCHP_PINMUX(c, 21, f, periph)

/* pc21i_sdhc1_sdwp */
#define PC21I_SDHC1_SDWP MCHP_PINMUX(c, 21, i, periph)

/* pc21n_ccl_in10 */
#define PC21N_CCL_IN10 MCHP_PINMUX(c, 21, n, periph)

/* pc22_gpio */
#define PC22_GPIO MCHP_PINMUX(c, 22, gpio, gpio)

/* pc22a_eic_extint6 */
#define PC22A_EIC_EXTINT6 MCHP_PINMUX(c, 22, a, periph)

/* pc22c_sercom1_pad0 */
#define PC22C_SERCOM1_PAD0 MCHP_PINMUX(c, 22, c, periph)

/* pc22d_sercom3_pad1 */
#define PC22D_SERCOM3_PAD1 MCHP_PINMUX(c, 22, d, periph)

/* pc22f_tcc0_wo6 */
#define PC22F_TCC0_WO6 MCHP_PINMUX(c, 22, f, periph)

/* pc23_gpio */
#define PC23_GPIO MCHP_PINMUX(c, 23, gpio, gpio)

/* pc23a_eic_extint7 */
#define PC23A_EIC_EXTINT7 MCHP_PINMUX(c, 23, a, periph)

/* pc23c_sercom1_pad1 */
#define PC23C_SERCOM1_PAD1 MCHP_PINMUX(c, 23, c, periph)

/* pc23d_sercom3_pad0 */
#define PC23D_SERCOM3_PAD0 MCHP_PINMUX(c, 23, d, periph)

/* pc23f_tcc0_wo7 */
#define PC23F_TCC0_WO7 MCHP_PINMUX(c, 23, f, periph)

/* pc24_gpio */
#define PC24_GPIO MCHP_PINMUX(c, 24, gpio, gpio)

/* pc24a_eic_extint8 */
#define PC24A_EIC_EXTINT8 MCHP_PINMUX(c, 24, a, periph)

/* pc24c_sercom0_pad2 */
#define PC24C_SERCOM0_PAD2 MCHP_PINMUX(c, 24, c, periph)

/* pc24d_sercom2_pad2 */
#define PC24D_SERCOM2_PAD2 MCHP_PINMUX(c, 24, d, periph)

/* pc24h_tpiu_traced3 */
#define PC24H_TPIU_TRACED3 MCHP_PINMUX(c, 24, h, periph)

/* pc25_gpio */
#define PC25_GPIO MCHP_PINMUX(c, 25, gpio, gpio)

/* pc25a_eic_extint9 */
#define PC25A_EIC_EXTINT9 MCHP_PINMUX(c, 25, a, periph)

/* pc25c_sercom0_pad3 */
#define PC25C_SERCOM0_PAD3 MCHP_PINMUX(c, 25, c, periph)

/* pc25d_sercom2_pad3 */
#define PC25D_SERCOM2_PAD3 MCHP_PINMUX(c, 25, d, periph)

/* pc25h_tpiu_traced2 */
#define PC25H_TPIU_TRACED2 MCHP_PINMUX(c, 25, h, periph)

/* pc26_gpio */
#define PC26_GPIO MCHP_PINMUX(c, 26, gpio, gpio)

/* pc26a_eic_extint10 */
#define PC26A_EIC_EXTINT10 MCHP_PINMUX(c, 26, a, periph)

/* pc26h_tpiu_traced1 */
#define PC26H_TPIU_TRACED1 MCHP_PINMUX(c, 26, h, periph)

/* pc27_gpio */
#define PC27_GPIO MCHP_PINMUX(c, 27, gpio, gpio)

/* pc27a_eic_extint11 */
#define PC27A_EIC_EXTINT11 MCHP_PINMUX(c, 27, a, periph)

/* pc27c_sercom1_pad0 */
#define PC27C_SERCOM1_PAD0 MCHP_PINMUX(c, 27, c, periph)

